{"title": "Privacy Policy | Grammarly", "byline": null, "dir": null, "lang": "en-US", "content": "<div id=\"readability-page-1\" class=\"page\"><div><p>If you live in a country in the European Union or the European Economic Area or live in the UK or Switzerland, you have the following rights:</p><ul><li><b>The right of access,</b> which enables you to receive a copy of your information.&nbsp;<br></li><li><b>The right to rectification,</b> which enables you to correct any inaccurate or incomplete information we hold about you.<br></li><li><b>The right to erasure, </b>which enables you to ask us to delete your information in certain circumstances.<br></li><li><b>The right to restrict processing,</b> which enables you to ask us to halt the processing of your information in certain circumstances.<br></li><li><b>The right to object, </b>which enables you to object to us processing your information on the basis of our legitimate interests (or those of a third party), including processing for direct marketing purposes or profiling for purposes of direct marketing.<br></li><li><b>The right to data portability,</b> which enables you to ask us to transmit information that you have provided to us, to a third party without hindrance, or to give you a copy of it so that you can transmit it to a third party, where technically feasible.<br></li><li><b><u>If you live in France</u></b><b>: the right to instruct us on use of your information after your death,</b> which enables you to instruct us now on the retention, deletion, and disclosure of your information after your death. You can change or revoke such instructions at any time.<br></li><li><b><u>If you live in Italy</u></b><b>: the right to stop your heirs exercising your GDPR rights after your death</b> through a written declaration. You may change or revoke these instructions at any time. This does not affect the exercise, by third parties, of property rights arising from your death, nor the right to defend their interests in court.<br></li></ul>\n<p>These rights may be limited, for example, if fulfilling your request would reveal personal data about another person, or if you ask us to delete information which we are required by law or have compelling legitimate interests to keep.&nbsp;</p><p>\nIf you wish to exercise any of these rights, please review our </p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://support.grammarly.com/hc/en-us/articles/40540355410957-Superhuman-Privacy-and-Data-Rights-Choices-and-Cookies\"><u>Privacy and Data Rights, Choices and Cookies page</u></a><p>..</p><p>\nWherever we rely on your consent, you have the right to withdraw that consent at any time, without affecting the lawfulness of processing based on consent before its withdrawal. We may however have other legal grounds for processing your data for other purposes, such as those set out above.&nbsp;</p><p>\nIf you have unresolved concerns, you can contact us at privacy@superhuman.com. You also have the right to complain to a data protection authority in the country that you reside in, the country of your place of work, or the country where the alleged infringement took place. If you are based in the EEA, details of EEA data protection authorities are available</p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://edpb.europa.eu/about-edpb/about-edpb/members_en\"> <u>here</u></a><p>. In the UK, this is the Information Commissioner’s Office and their website is</p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://ico.org.uk/make-a-complaint/\"> <u>here</u></a><p>. In Switzerland, the contact details are available </p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://www.edoeb.admin.ch/en/contact-2\"><u>here</u></a><p>.&nbsp;</p><p>\n<b>Data transfers</b></p><p>\n<i>Transfers to the United States</i></p><p>\nFor personal data about EEA, Swiss and UK individuals, we comply with the EU-U.S. Data Privacy Framework, the UK Extension of the EU-U.S. Data Privacy Framework and the Swiss-U.S. Data Privacy Framework, each as set forth by the U.S. Department of Commerce (collectively, the “<b>Frameworks</b>”), regarding the collection, use, and retention of personal data transferred from the EEA, UK, and Switzerland in reliance on the Frameworks.&nbsp;</p><p>\nAs described in Superhuman Platform Inc.’s Frameworks certification, we have certified that we adhere to the Frameworks Principles with respect to such information. To learn more about the Data Privacy Framework program and to view our certification, please visit </p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://www.dataprivacyframework.gov/s/\"><u>https://www.dataprivacyframework.gov/</u></a><p>.</p><p>\nIn compliance with the Frameworks, we commit to resolve complaints about our processing of your personal data under the Frameworks. If you have questions about our compliance with Frameworks Principles, you should first contact us at: </p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"mailto:privacy@superhuman.com\"><u>privacy@superhuman.com</u></a><p>.&nbsp;</p><p>\nUnder the Frameworks, we commit to refer unresolved complaints concerning our handling of personal data received under the Frameworks to VeraSafe, an alternative dispute resolution provider based in the United States. If you do not receive timely acknowledgment of your complaint from us, or if we have not addressed your complaint to your satisfaction, please visit </p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://verasafe.com/public-resources/dispute-resolution/submit-dispute/\"><u>here</u></a><p> for more information or to file a complaint.</p><p>\nIf your complaint is not resolved through these channels, under certain conditions, a binding arbitration option may be available before a Data Privacy Framework Panel. For additional information, please visit: </p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://www.dataprivacyframework.gov/framework-article/ANNEX-I-introduction\"><u>https://www.dataprivacyframework.gov/framework-article/ANNEX-I-introduction</u></a><p>.&nbsp;</p><p>\nFinally, we remain responsible under the Onward Transfer Principle for personal data that we disclose to third parties for processing on our behalf. To learn more about the Frameworks or to view our certification, please visit the Frameworks </p><a rel=\"noopener noreferrer\" target=\"_blank\" href=\"https://www.dataprivacyframework.gov/\"><u>website</u></a><p>. The Federal Trade Commission has jurisdiction over our compliance with the Frameworks.</p><p>\n<i>Transfers to other third countries&nbsp;</i></p><p>\nFor transfers from the EEA/UK to other countries, we rely on standard contractual clauses published by the EU Commission or the UK government or recognized in Switzerland.</p><p>\nYou can ask us for a copy of the relevant contracts or other measures we rely upon to transfer personal data by using the contact details below.</p></div></div>", "textContent": "If you live in a country in the European Union or the European Economic Area or live in the UK or Switzerland, you have the following rights:The right of access, which enables you to receive a copy of your information. The right to rectification, which enables you to correct any inaccurate or incomplete information we hold about you.The right to erasure, which enables you to ask us to delete your information in certain circumstances.The right to restrict processing, which enables you to ask us to halt the processing of your information in certain circumstances.The right to object, which enables you to object to us processing your information on the basis of our legitimate interests (or those of a third party), including processing for direct marketing purposes or profiling for purposes of direct marketing.The right to data portability, which enables you to ask us to transmit information that you have provided to us, to a third party without hindrance, or to give you a copy of it so that you can transmit it to a third party, where technically feasible.If you live in France: the right to instruct us on use of your information after your death, which enables you to instruct us now on the retention, deletion, and disclosure of your information after your death. You can change or revoke such instructions at any time.If you live in Italy: the right to stop your heirs exercising your GDPR rights after your death through a written declaration. You may change or revoke these instructions at any time. This does not affect the exercise, by third parties, of property rights arising from your death, nor the right to defend their interests in court.\nThese rights may be limited, for example, if fulfilling your request would reveal personal data about another person, or if you ask us to delete information which we are required by law or have compelling legitimate interests to keep. \nIf you wish to exercise any of these rights, please review our Privacy and Data Rights, Choices and Cookies page..\nWherever we rely on your consent, you have the right to withdraw that consent at any time, without affecting the lawfulness of processing based on consent before its withdrawal. We may however have other legal grounds for processing your data for other purposes, such as those set out above. \nIf you have unresolved concerns, you can contact us at privacy@superhuman.com. You also have the right to complain to a data protection authority in the country that you reside in, the country of your place of work, or the country where the alleged infringement took place. If you are based in the EEA, details of EEA data protection authorities are available here. In the UK, this is the Information Commissioner’s Office and their website is here. In Switzerland, the contact details are available here. \nData transfers\nTransfers to the United States\nFor personal data about EEA, Swiss and UK individuals, we comply with the EU-U.S. Data Privacy Framework, the UK Extension of the EU-U.S. Data Privacy Framework and the Swiss-U.S. Data Privacy Framework, each as set forth by the U.S. Department of Commerce (collectively, the “Frameworks”), regarding the collection, use, and retention of personal data transferred from the EEA, UK, and Switzerland in reliance on the Frameworks. \nAs described in Superhuman Platform Inc.’s Frameworks certification, we have certified that we adhere to the Frameworks Principles with respect to such information. To learn more about the Data Privacy Framework program and to view our certification, please visit https://www.dataprivacyframework.gov/.\nIn compliance with the Frameworks, we commit to resolve complaints about our processing of your personal data under the Frameworks. If you have questions about our compliance with Frameworks Principles, you should first contact us at: privacy@superhuman.com. \nUnder the Frameworks, we commit to refer unresolved complaints concerning our handling of personal data received under the Frameworks to VeraSafe, an alternative dispute resolution provider based in the United States. If you do not receive timely acknowledgment of your complaint from us, or if we have not addressed your complaint to your satisfaction, please visit here for more information or to file a complaint.\nIf your complaint is not resolved through these channels, under certain conditions, a binding arbitration option may be available before a Data Privacy Framework Panel. For additional information, please visit: https://www.dataprivacyframework.gov/framework-article/ANNEX-I-introduction. \nFinally, we remain responsible under the Onward Transfer Principle for personal data that we disclose to third parties for processing on our behalf. To learn more about the Frameworks or to view our certification, please visit the Frameworks website. The Federal Trade Commission has jurisdiction over our compliance with the Frameworks.\nTransfers to other third countries \nFor transfers from the EEA/UK to other countries, we rely on standard contractual clauses published by the EU Commission or the UK government or recognized in Switzerland.\nYou can ask us for a copy of the relevant contracts or other measures we rely upon to transfer personal data by using the contact details below.", "length": 5251, "excerpt": "Grammarly’s free writing app will make sure your messages, documents, and social media posts are clear, mistake-free, and impactful.", "siteName": null, "applied": false}