{"title": "AdBlock", "byline": "AdBlock", "dir": null, "lang": "en", "content": "<div id=\"readability-page-1\" class=\"page\"><p>The Wayback Machine - https://getadblock.com/en/privacy/</p><section id=\"mainContent\" role=\"main\">\n            \n            <p>\n                This Privacy Policy describes AdBlock's information practices for its website, browser extension, and applications. We take your privacy seriously\n                and want you to understand exactly what information we collect, how we process that information, which pieces of information you can\n                request us to remove, and how to contact us about this policy. Please read this policy carefully.\n            </p>\n            <p>\n                When it comes to your personal information, most of this policy applies to users who choose to donate to support AdBlock or purchase one of our\n                paid products. <strong>If all you do is use the extension then you're practically, except for an anonymous, unique ID, invisible to us.</strong>\n            </p>\n\n            <h2>Who is responsible for data collection and processing (contacts)?</h2>\n\n            <p><b>Controller</b></p>\n            <p>The legal person responsible for the collection, processing and / or use of personal information in connection with our websites and\n                products (\"Controller\") is:</p>\n            <p>\n                <b>Adblock, Inc.</b><br>\n                12333 Sowden Road Suite B<br>\n                PO Box #99623<br>\n                Houston, Texas 77080-2059<br>\n                gdprrep@adblock.org<br>\n            </p>\n            <p><b>Representative in the European Union</b></p>\n            <p>Our representative in the European Union in accordance with Art. 27 General Data Protection Regulation (“GDPR”) is:</p>\n            <p>\n                <b>Reuschlaw Legal Consultants</b><br>\n                Piltz Rechtsanwälte PartGmbB<br>\n                Mozartstraße 16, 12247 Berlin<br>\n                Attention: Carlo Piltz<br>\n            </p>\n            <p><b>What is personal information?</b></p>\n            <p>\n                The purpose of data protection is to protect personal information. Personal information means any information relating to an identified\n                or identifiable natural person (\"<b>data subject</b>\"). An identifiable natural person is one who can be identified, directly or indirectly,\n                in particular, by reference to an identifier such as a name, an identification number, location data, an online identifier or to one or more\n                factors specific to the physical, physiological, genetic, mental, economic, cultural or social identity of that natural person. This\n                information includes, for example, details such as name and email address, but also information in connection with payments.\n            </p>\n\n            <h2>Information AdBlock collects</h2>\n\n            <p><b>Personal information</b></p>\n            <p>\n                When you visit the AdBlock website we collect IP address, unique ID, logging of some of the button clicks on our website (clicking download,\n                for example) and user event logging data. When the AdBlock extension communicates with AdBlock servers, we receive the computer’s IP address.\n                After six months we will remove any identifying information such as IP address from our log files and databases.\n            </p>\n            <p>\n                When you donate from the AdBlock website, we collect and store all information, excluding the credit card number, given during\n                the payment process. This includes IP address, unique ID, logging some of the button clicks (payment, download buttons) and user event logging.\n                AdBlock does not handle or have access to full credit card numbers, bank account details or payment account login information. Each payment\n                processor stores and uses the data you provide them differently.\n            </p>\n            <p>\n                AdBlock uses both Stripe and PayPal as payment processors when you donate to AdBlock. To learn more about their data collection policies,\n                please consult their respective privacy policies when using them.\n            </p>\n\n            <p><b>AdBlock Premium</b></p>\n            <p>\n                When you purchase or otherwise obtain a AdBlock Premium license AdBlock will store information regarding the license, including:\n                unique extension identifiers associated with the license, email associated with the license, last license check timestamp and license \n                status. This data will be stored during the active lifetime of the license and for a period after cancellation.\n            </p>\n            <p>\n                The same data that is stored when you make a donation to AdBlock is stored when you purchase Premium. \n            </p>\n\n            <p><b>AdBlock Premium - Sync</b></p>\n            <p>\n                If you elect to use the Sync feature of AdBlock Premium then AdBlock collects information about the particular extension installation, including: unique\n                extension identifier, sync device name and the timestamp of when the sync enrollment was made. This data will be stored during the active lifetime of\n                the license and for a period after cancellation.\n            </p>\n            <p>\n                AdBlock also stores the entire set of extension settings in plain text on our servers to accommodate the sync functionality across multiple extension\n                installations. This storage location has restricted access and is only made available to AdBlock employees to diagnose and fix errors with the sync\n                service. Every reasonable precaution is taken to secure this storage location but no database or server is 100% secure, and we cannot guarantee the\n                absolute security of the extension settings data. If you have concerns about the AdBlock extension settings data being compromised, since there is\n                no current mechanism to encrypt the data from the user's end, please carefully consider whether you want to use this feature.\n            </p>\n            <p>\n                Finally, AdBlock Premium - Sync uses PubNub for real time sync notifications. Please refer to the <a href=\"https://www.pubnub.com/privacy-policy/\">\n                PubNub privacy policy</a> for information on their data collection policies. PubNub is used to alert the extension of a new settings version only \n                and does not have access to the extension settings information.\n            </p>\n\n            <p><b>AdBlock VPN</b></p>\n            <p>\n                When you purchase an AdBlock VPN license, AdBlock will store information regarding the license, including: unique identifiers associated with the license,\n                email associated with the license, last license check timestamp and license status. This data will be stored during the active lifetime of the license and\n                for a period after cancellation.\n            </p>\n            <p>\n                We use the analytic services from Firebase Events from Google LLC, 1600 Amphitheatre Parkway, Mountain View, CA 94043, USA. on an opt-in basis to analyze\n                and improve the functionality of our software and to optimize your user experience. In each instance, only anonymized data is utilized.\n            </p>\n            <p>\n                Please note, we do not collect any data about the web pages you visit or the services you use on the internet. Furthermore, we don’t—and never will—sell\n                or share any data about your browsing habits.\n            </p>\n\n            <p><b>Mobile applications</b></p>\n            <p>\n                When using our mobile products, we collect data when specific interactions take place (\"event tracking\"), including: app/extension version, type of device, IP address, anonymous interaction events (like button clicks) and the platform (Android, iOS) used. We also collect data related to unexpected crashes or errors to analyze and solve any malfunctions, including: app/extension version, type of device, UUID and crash traces, instance and application IDs, free space and free ram, as well as the timestamp of the crash.\n            </p>\n            <p>\n                Data on event tracking is deleted after 60 days. Crash reports are retained for 180 days, related Instance IDs are deleted in accordance with Firebase’s retention policies.\n            </p>\n            <p>\n                For both event tracking and crash reporting, the data collection is solely used to improve the functionality and user experience of our mobile products and can be opted-out in the settings menu. We use the analytic services from Firebase Events from Google LLC, 1600 Amphitheatre Parkway, Mountain View, CA 94043, USA. on an opt-out basis to analyze and improve the functionality of our mobile applications and to optimize your user experience. In each instance, only anonymized data is utilized.\n            </p>\n\n            <p><b>Anonymous information</b></p>\n            <p>\n                The AdBlock extension captures anonymous usage information including, but not limited to, the version number of the extension, preferred language,\n                Acceptable Ads opt-in, opt-in to advanced features like our local content caching service, number of blocked requests, number of ads blocked, and\n                browser and operating system type. The AdBlock extension also assigns an anonymous, unique ID to each installation. We store aggregate statistics\n                about the installation connected with each user ID indefinitely. We utilize this information to help us identify and fix potential issues with\n                AdBlock as well as to determine the performance of AdBlock features.\n            </p>\n            <p>\n                The iOS extension captures connection type (wifi or mobile) in addition to the data that the browser extension captures.\n            </p>\n\n            <p><b>Extension error information</b></p>\n            <p>\n                An error report is automatically sent to AdBlock's servers whenever an error occurs in the extension. The report contains the anonymous\n                information stated previously along with the current browser version and a description of the error. If a URL exists in the error description\n                then the extension will attempt to remove it. The data is used for troubleshooting and to identify general defects which lead to unexpected\n                crashes or errors. After 7 days we will remove this information from our log files and databases.\n            </p>\n\n            <p><b>Server logs</b></p>\n            <p>\n                Logs for general requests made to getadblock.com or its infrastructure are kept for up to 90 days. These logs include the IP address, browser,\n                operating system, and page address. We will anonymize the IP address by using a hash to encrypt this information and we will immediately\n                delete the original IP address. This data is used to generate usage statistics as well as to investigate potential security issues. After\n                90 days, we will remove this information from our log files and databases.\n            </p>\n            <p>\n                Logs for payment processing requests are kept in accordance with US tax law retention periods and will be deleted after the end of the\n                respective retention period. Information in these logs includes IP address, email (if provided), address (if provided), name (if provided),\n                browser type and version, operating system, payment amount, payment type, card type, expiration date, and last four digits of the card if a card is used.\n                This data is used to provide insights into the financial performance of AdBlock.\n            </p>\n\n            <p id=\"analytics\"><b>Analytics</b></p>\n            <p>\n                AdBlock uses Google Analytics to aggregate information about traffic patterns and how our website, extensions, and mobile applications are used. We limit the data sent to Google Analytics, and only do so to improve our extension and website. You can find information about Google Analytics’ data collection\n                practices, as well as its privacy policy <a href=\"https://support.google.com/analytics/answer/6004245\">here</a>.\n            </p>\n\n            <p><b>For users in the European Union and European Economic Area</b></p>\n            <span>\n                We use Google Analytics on our Website, a web analysis service of Google Inc. (\"Google\"). Google Analytics uses so-called \"cookies\" (text\n                files which are stored on your computer and which enable you to analyse your use of our Website). The information generated by the cookie\n                on your use of our Website (including your abbreviated IP address) is transmitted to a Google server in the United States and is stored\n                there. Google will use this information to assess your use of our Website, to compile reports on the activities for us and to provide more\n                services connected with use of our Website and the internet. It is also possible that Google may transmit this information to third parties\n                if this is required by law, or if third parties process this information on behalf of Google.\n            </span> \n            <div id=\"settings-modal-container-privacy\">\n                    <ul id=\"list-cookie-settings\">\n                        <li>\n                        <div>\n                            <p><span>Necessary cookies</span></p><lable>\n                            \n                            <i>toggle_on</i>\n                            </lable>\n                        </div>\n                        <p>\n                            <span>Used to remember your privacy preferences.</span>\n                            <span>They cannot be switched off.</span>\n                        </p>\n                        </li>\n                        <li>\n                        <div>\n                            <p><span>Tracking cookies</span></p><lable>\n                            \n                            <i>toggle_on</i>\n                            </lable>\n                        </div>\n                        <p>\n                            <span>We use these to analyze website traffic.</span>\n                        </p>\n                        </li>\n                    </ul>\n                    </div>\n            <p>\n                <b>You can deactivate Google Analytics by means of a browser add-on if you do not want to participate in Website analysis. You can download this\n                <a href=\"https://tools.google.com/dlpage/gaoptout?hl=de\">here</a>.</b>\n            </p>\n\n            <h2>How AdBlock processes and discloses collected information</h2>\n            \n            <p><b>We try to make AdBlock better</b></p>\n            <p>\n                We use the collected usage and analytics information to maintain and improve the AdBlock extension and website, gain insight into how\n                our services are being used, and in our efforts to prevent fraud. The information is only used internally.\n            </p>\n\n            <p><b>Your information is not for sale</b></p>\n            <p>\n                AdBlock never has and never will sell your personal information to any third party without your consent. We sometimes share anonymized and\n                aggregated information that cannot be associated with an individual with third parties or the public.\n            </p>\n\n            <p><b>AdBlock discloses personal information as required by law</b></p>\n            <p>\n                AdBlock cooperates with all valid United States law enforcement requests and court orders. If possible, we'll notify you of requests for\n                your information using the email stored in our system. Some circumstances prohibit us from contacting you about a request or order (e.g.\n                an order under 18 U.S.C. § 2705(b) or § 215 of the Patriot Act). <a href=\"http://en.wikipedia.org/wiki/Warrant_canary\">\"Warrant canary\"</a>:\n                AdBlock has never received an order under Section 215 of the Patriot Act, and if this sentence ever disappears, you'll know it's because we\n                have received such an order -- or similar order -- and the U.S. Government made us delete it.\n            </p>\n\n            <p><b>AdBlock discloses personal information as part of business development</b></p>\n            <p>\n                As part of the further development of our business, it may happen that the structure of Adblock, Inc. changes. The legal structure may be\n                adapted, subsidiaries, business units or components may be created, bought or sold. In such transactions user information may be shared with\n                the transmitted part of the company. In the event of a transfer of personal information Adblock, Inc. will ensure that it is done in\n                accordance with this privacy policy and the GDPR and applicable EU laws.\n            </p>\n            <p>\n                We will not transfer your personal data to third parties as a matter of course without letting you know in advance. We will ask for your\n                prior permission unless the transfer of such data is permitted by GDPR or any other applicable EU laws.\n            </p>\n\n            <h2>External services</h2>\n            <p>\n                AdBlock uses external services that may require you to enter personal information. We currently use\n                FreshDesk (privacy policy <a href=\"https://www.freshworks.com/privacy/\">here</a>) for AdBlock's\n                <a href=\"https://help.getadblock.com/\">knowledge base and support system</a>. AdBlock has used other services in the past\n                and may use more in the future. We do not control the data on these external services and can not remove or delete the data;\n                any data given to external services is not bound by this policy, and you should read the external service's privacy policy before providing any information.\n            </p>\n\n            <h2>Data security</h2>\n            <p>\n                All personal and usage information that AdBlock collects is stored in our databases and AdBlock takes reasonable steps to keep it secure.\n                That said, no database or server is 100% secure and we cannot guarantee the absolute security of your data in our system or while being\n                transmitted over the Internet. Our best effort is given, but you use AdBlock's website and browser extension at your own risk.\n            </p>\n\n            <h2>What is the legal basis?</h2>\n            <h3>We collect and process your personal information in compliance with the GDPR and the applicable EU laws.</h3>\n            \n            <p><b>Collection and processing is based on your consent: Art. 6 (1) a GDPR, Art. 4 (11) GDPR</b></p>\n            <p>\n                We will always ask for your consent to collect and process your personal information for the aforementioned specific purposes, unless the\n                collection and processing of your personal information is permitted by statutory laws. Where you have provided us with your consent to the\n                collection and processing of your personal information for the aforementioned specific purposes, you have the right to withdraw your consent\n                at any time.\n            </p>\n            <p><b>Collection and processing is necessary for taking steps prior to enter into a contract: Art. 6 (1) b GDPR</b></p>\n            <p>\n                The collection and processing of your personal information may be necessary for the performance of a contract to which you may be a party.\n                Prior to entering into such a contract, the collection and processing of your personal information may also be necessary in order to take steps\n                at your request. This applies for installation and the use of our extension as well as any payment processing in connection with donations.\n            </p>\n            <p><b>Collection and processing is necessary for compliance with a legal obligation to which the Controller is subject: Art. 6 (1) c GDPR</b></p>\n            <p>\n                Collection and processing of your personal information may be necessary for compliance with a legal obligation to which we are subject under\n                EU laws or the laws of a EU Member State.\n            </p>\n            <p><b>Collection and processing is necessary for the purposes of our legitimate interests: Art. 6 (1) f GDPR</b></p>\n            <p>\n                The collection and processing of your personal information may be necessary for the purposes of our legitimate interests. We collect and process\n                server logs for technical reasons, such as, but not limited to, preventing denial of service attacks. Denial of service is typically accomplished\n                by flooding the targeted machine or resource with superfluous requests in an attempt to overload systems and prevent some or all legitimate requests\n                from being fulfilled. Preventing such overloads of our systems and any security issues by denial of service attacks is in your and our vital interest\n                and therefore we use the website logs. We use information collected and processed via subscription downloads, extension update checks, emergency\n                notifications and feedback data sent by you, for technical reasons, such as, but not limited to, ensuring the security of the extension version used\n                by you. Ensuring the security of our extension is in your and our vital interest and therefore we use such data. Furthermore, we collect and process\n                such data to ensure that our website and extension are constantly improved and adjusted to the changing requirements for an efficient usability\n                and the technical environment. Ensuring the usability of our websites and of our extension is in your and our vital interest and therefore we use such data.\n            </p>\n            <p><b>Jointly determining purposes and means of data processing: Art. 26 (1) GDPR</b></p>\n            <p>\n                To build and improve upon products and features more efficiently, we share personal data, in compliance with GDPR, within the context of a joint controllership with partners. This does not affect how we process personal data as outlined in this privacy policy or how you can exercise your data subject’s rights towards us. You can always contact us with questions or feedback about our privacy policy <a href=\"https://help.getadblock.com/\" target=\"_blank\">here</a> and can receive the essence of the arrangement between us and our partners via e-mail to <a href=\"mailto:privacy@adblock.org\">privacy@adblock.org</a>.\n            </p>\n\n            <h2>What rights do you have?</h2>\n            <p>\n                In compliance with the GDPR and the applicable EU laws and to the extent legally permitted, you have the following rights to protect your personal\n                information collected and processed by us:\n            </p>\n            <p><b>Information, access, rectification and restriction rights</b></p>\n            <p>\n                Naturally you have the right to receive, upon request, information about the personal information stored by us about you and information about how we\n                collect, process and store your personal information. Where that is the case, you have the right to gain access to such personal information stored by us.\n                You have the right to request from us the rectification of your inaccurate personal information. Taking into account the purposes of collecting and\n                processing your data, you have the right to have incomplete personal information completed. You have the right to request restriction of processing.\n            </p>\n            <p><b>Right to data portability</b></p>\n            <p>\n                You also have the right (1) to receive all personal information concerning you and which you have provided to us, in a structured, commonly used and\n                machine-readable format and (2) to transmit that data to another controller.\n            </p>\n            <p><b>Right to erasure of your data</b></p>\n            <p>\n                You have the right to demand from us the erasure of your personal information, where – inter alia – one of the following grounds applies:\n            </p>\n            <ul>\n                    <li>If we no longer need your personal information for the aforementioned purposes.</li>\n                    <li>If you withdraw your consent on which the collection and processing is based and where there are no other legal grounds for the collection and processing.</li>\n                    <li>If you object to the collection and processing and there are no overriding legitimate grounds for the collection and processing.</li>\n                </ul>\n            \n            <p>\n                Please note, if data needs to be retained for legal purposes pursuant to Art. 17 (3) GDPR, we will restrict the use of the respective data.\n            </p>\n\n            <h2>Personal information in connection with payments</h2>\n            <p>\n                If you have attempted a payment on the AdBlock website then you can request to have your email and name removed from our system. To\n                do this, please open a private ticket <a href=\"https://help.getadblock.com/\">on our support site</a> that contains\n                your Order ID or email for the purchase. Please note that AdBlock can only remove information from our own systems and cannot\n                make changes to data that you give to a payment processor.\n            </p>\n\n            <p><b>Right to lodge a complaint with a supervisory authority</b></p>\n            <p>\n                You have the right to lodge a complaint with a supervisory authority, in particular in the Member State of your habitual residence, place of work\n                or place of the alleged infringement if you consider that the collection and processing of personal information relating to you infringes the GDPR.\n            </p>\n            <p><b>Right to object to the processing of your data</b></p>\n            <p>\n                You have the right to object at any time to the collection and processing of your personal information on grounds relating to your particular\n                situation, when collection and processing is based on our legitimate interest (Art. 6 (1) f GDPR).\n            </p>\n            <p><b>Right to withdraw your consent at any time</b></p>\n            <p>\n                You have the right to withdraw your consent at any time, when you have provided us with your consent to the collection and processing of your\n                personal information for one or more specific purposes.\n            </p>\n            <p><b>How to exercise your rights</b></p>\n            <p>\n                To exercise your rights, please contact us <a href=\"https://help.getadblock.com/\">here</a>.\n            </p>\n\n            <h2>Changes and updates to this policy</h2>\n            <p>\n                AdBlock reserves the right to change this policy for any reason, and may make small, inconsequential changes to this\n                policy with or without notice. Each time this policy is changed we will revise the \"Effective Date\" at the top of this page.\n                When substantial changes are made to the disclosure of your personal information AdBlock will attempt to notify you through\n                the email that was provided during the payment process. Your continued use of the AdBlock website or browser extension constitutes your\n                agreement to this Privacy Policy and any revisions or updates.\n            </p>\n\n            <h2>Contact</h2>\n            <p>\n                You can always contact us with questions or feedback about our privacy policy <a href=\"https://help.getadblock.com/\">here</a>.\n            </p>\n            </section></div>", "textContent": "The Wayback Machine - https://web.archive.org/web/20220318225253/https://getadblock.com/en/privacy/\n            \n            \n                This Privacy Policy describes AdBlock's information practices for its website, browser extension, and applications. We take your privacy seriously\n                and want you to understand exactly what information we collect, how we process that information, which pieces of information you can\n                request us to remove, and how to contact us about this policy. Please read this policy carefully.\n            \n            \n                When it comes to your personal information, most of this policy applies to users who choose to donate to support AdBlock or purchase one of our\n                paid products. If all you do is use the extension then you're practically, except for an anonymous, unique ID, invisible to us.\n            \n\n            Who is responsible for data collection and processing (contacts)?\n\n            Controller\n            The legal person responsible for the collection, processing and / or use of personal information in connection with our websites and\n                products (\"Controller\") is:\n            \n                Adblock, Inc.\n                12333 Sowden Road Suite B\n                PO Box #99623\n                Houston, Texas 77080-2059\n                gdprrep@adblock.org\n            \n            Representative in the European Union\n            Our representative in the European Union in accordance with Art. 27 General Data Protection Regulation (“GDPR”) is:\n            \n                Reuschlaw Legal Consultants\n                Piltz Rechtsanwälte PartGmbB\n                Mozartstraße 16, 12247 Berlin\n                Attention: Carlo Piltz\n            \n            What is personal information?\n            \n                The purpose of data protection is to protect personal information. Personal information means any information relating to an identified\n                or identifiable natural person (\"data subject\"). An identifiable natural person is one who can be identified, directly or indirectly,\n                in particular, by reference to an identifier such as a name, an identification number, location data, an online identifier or to one or more\n                factors specific to the physical, physiological, genetic, mental, economic, cultural or social identity of that natural person. This\n                information includes, for example, details such as name and email address, but also information in connection with payments.\n            \n\n            Information AdBlock collects\n\n            Personal information\n            \n                When you visit the AdBlock website we collect IP address, unique ID, logging of some of the button clicks on our website (clicking download,\n                for example) and user event logging data. When the AdBlock extension communicates with AdBlock servers, we receive the computer’s IP address.\n                After six months we will remove any identifying information such as IP address from our log files and databases.\n            \n            \n                When you donate from the AdBlock website, we collect and store all information, excluding the credit card number, given during\n                the payment process. This includes IP address, unique ID, logging some of the button clicks (payment, download buttons) and user event logging.\n                AdBlock does not handle or have access to full credit card numbers, bank account details or payment account login information. Each payment\n                processor stores and uses the data you provide them differently.\n            \n            \n                AdBlock uses both Stripe and PayPal as payment processors when you donate to AdBlock. To learn more about their data collection policies,\n                please consult their respective privacy policies when using them.\n            \n\n            AdBlock Premium\n            \n                When you purchase or otherwise obtain a AdBlock Premium license AdBlock will store information regarding the license, including:\n                unique extension identifiers associated with the license, email associated with the license, last license check timestamp and license \n                status. This data will be stored during the active lifetime of the license and for a period after cancellation.\n            \n            \n                The same data that is stored when you make a donation to AdBlock is stored when you purchase Premium. \n            \n\n            AdBlock Premium - Sync\n            \n                If you elect to use the Sync feature of AdBlock Premium then AdBlock collects information about the particular extension installation, including: unique\n                extension identifier, sync device name and the timestamp of when the sync enrollment was made. This data will be stored during the active lifetime of\n                the license and for a period after cancellation.\n            \n            \n                AdBlock also stores the entire set of extension settings in plain text on our servers to accommodate the sync functionality across multiple extension\n                installations. This storage location has restricted access and is only made available to AdBlock employees to diagnose and fix errors with the sync\n                service. Every reasonable precaution is taken to secure this storage location but no database or server is 100% secure, and we cannot guarantee the\n                absolute security of the extension settings data. If you have concerns about the AdBlock extension settings data being compromised, since there is\n                no current mechanism to encrypt the data from the user's end, please carefully consider whether you want to use this feature.\n            \n            \n                Finally, AdBlock Premium - Sync uses PubNub for real time sync notifications. Please refer to the \n                PubNub privacy policy for information on their data collection policies. PubNub is used to alert the extension of a new settings version only \n                and does not have access to the extension settings information.\n            \n\n            AdBlock VPN\n            \n                When you purchase an AdBlock VPN license, AdBlock will store information regarding the license, including: unique identifiers associated with the license,\n                email associated with the license, last license check timestamp and license status. This data will be stored during the active lifetime of the license and\n                for a period after cancellation.\n            \n            \n                We use the analytic services from Firebase Events from Google LLC, 1600 Amphitheatre Parkway, Mountain View, CA 94043, USA. on an opt-in basis to analyze\n                and improve the functionality of our software and to optimize your user experience. In each instance, only anonymized data is utilized.\n            \n            \n                Please note, we do not collect any data about the web pages you visit or the services you use on the internet. Furthermore, we don’t—and never will—sell\n                or share any data about your browsing habits.\n            \n\n            Mobile applications\n            \n                When using our mobile products, we collect data when specific interactions take place (\"event tracking\"), including: app/extension version, type of device, IP address, anonymous interaction events (like button clicks) and the platform (Android, iOS) used. We also collect data related to unexpected crashes or errors to analyze and solve any malfunctions, including: app/extension version, type of device, UUID and crash traces, instance and application IDs, free space and free ram, as well as the timestamp of the crash.\n            \n            \n                Data on event tracking is deleted after 60 days. Crash reports are retained for 180 days, related Instance IDs are deleted in accordance with Firebase’s retention policies.\n            \n            \n                For both event tracking and crash reporting, the data collection is solely used to improve the functionality and user experience of our mobile products and can be opted-out in the settings menu. We use the analytic services from Firebase Events from Google LLC, 1600 Amphitheatre Parkway, Mountain View, CA 94043, USA. on an opt-out basis to analyze and improve the functionality of our mobile applications and to optimize your user experience. In each instance, only anonymized data is utilized.\n            \n\n            Anonymous information\n            \n                The AdBlock extension captures anonymous usage information including, but not limited to, the version number of the extension, preferred language,\n                Acceptable Ads opt-in, opt-in to advanced features like our local content caching service, number of blocked requests, number of ads blocked, and\n                browser and operating system type. The AdBlock extension also assigns an anonymous, unique ID to each installation. We store aggregate statistics\n                about the installation connected with each user ID indefinitely. We utilize this information to help us identify and fix potential issues with\n                AdBlock as well as to determine the performance of AdBlock features.\n            \n            \n                The iOS extension captures connection type (wifi or mobile) in addition to the data that the browser extension captures.\n            \n\n            Extension error information\n            \n                An error report is automatically sent to AdBlock's servers whenever an error occurs in the extension. The report contains the anonymous\n                information stated previously along with the current browser version and a description of the error. If a URL exists in the error description\n                then the extension will attempt to remove it. The data is used for troubleshooting and to identify general defects which lead to unexpected\n                crashes or errors. After 7 days we will remove this information from our log files and databases.\n            \n\n            Server logs\n            \n                Logs for general requests made to getadblock.com or its infrastructure are kept for up to 90 days. These logs include the IP address, browser,\n                operating system, and page address. We will anonymize the IP address by using a hash to encrypt this information and we will immediately\n                delete the original IP address. This data is used to generate usage statistics as well as to investigate potential security issues. After\n                90 days, we will remove this information from our log files and databases.\n            \n            \n                Logs for payment processing requests are kept in accordance with US tax law retention periods and will be deleted after the end of the\n                respective retention period. Information in these logs includes IP address, email (if provided), address (if provided), name (if provided),\n                browser type and version, operating system, payment amount, payment type, card type, expiration date, and last four digits of the card if a card is used.\n                This data is used to provide insights into the financial performance of AdBlock.\n            \n\n            Analytics\n            \n                AdBlock uses Google Analytics to aggregate information about traffic patterns and how our website, extensions, and mobile applications are used. We limit the data sent to Google Analytics, and only do so to improve our extension and website. You can find information about Google Analytics’ data collection\n                practices, as well as its privacy policy here.\n            \n\n            For users in the European Union and European Economic Area\n            \n                We use Google Analytics on our Website, a web analysis service of Google Inc. (\"Google\"). Google Analytics uses so-called \"cookies\" (text\n                files which are stored on your computer and which enable you to analyse your use of our Website). The information generated by the cookie\n                on your use of our Website (including your abbreviated IP address) is transmitted to a Google server in the United States and is stored\n                there. Google will use this information to assess your use of our Website, to compile reports on the activities for us and to provide more\n                services connected with use of our Website and the internet. It is also possible that Google may transmit this information to third parties\n                if this is required by law, or if third parties process this information on behalf of Google.\n             \n            \n                    \n                        \n                        \n                            Necessary cookies\n                            \n                            toggle_on\n                            \n                        \n                        \n                            Used to remember your privacy preferences.\n                            They cannot be switched off.\n                        \n                        \n                        \n                        \n                            Tracking cookies\n                            \n                            toggle_on\n                            \n                        \n                        \n                            We use these to analyze website traffic.\n                        \n                        \n                    \n                    \n            \n                You can deactivate Google Analytics by means of a browser add-on if you do not want to participate in Website analysis. You can download this\n                here.\n            \n\n            How AdBlock processes and discloses collected information\n            \n            We try to make AdBlock better\n            \n                We use the collected usage and analytics information to maintain and improve the AdBlock extension and website, gain insight into how\n                our services are being used, and in our efforts to prevent fraud. The information is only used internally.\n            \n\n            Your information is not for sale\n            \n                AdBlock never has and never will sell your personal information to any third party without your consent. We sometimes share anonymized and\n                aggregated information that cannot be associated with an individual with third parties or the public.\n            \n\n            AdBlock discloses personal information as required by law\n            \n                AdBlock cooperates with all valid United States law enforcement requests and court orders. If possible, we'll notify you of requests for\n                your information using the email stored in our system. Some circumstances prohibit us from contacting you about a request or order (e.g.\n                an order under 18 U.S.C. § 2705(b) or § 215 of the Patriot Act). \"Warrant canary\":\n                AdBlock has never received an order under Section 215 of the Patriot Act, and if this sentence ever disappears, you'll know it's because we\n                have received such an order -- or similar order -- and the U.S. Government made us delete it.\n            \n\n            AdBlock discloses personal information as part of business development\n            \n                As part of the further development of our business, it may happen that the structure of Adblock, Inc. changes. The legal structure may be\n                adapted, subsidiaries, business units or components may be created, bought or sold. In such transactions user information may be shared with\n                the transmitted part of the company. In the event of a transfer of personal information Adblock, Inc. will ensure that it is done in\n                accordance with this privacy policy and the GDPR and applicable EU laws.\n            \n            \n                We will not transfer your personal data to third parties as a matter of course without letting you know in advance. We will ask for your\n                prior permission unless the transfer of such data is permitted by GDPR or any other applicable EU laws.\n            \n\n            External services\n            \n                AdBlock uses external services that may require you to enter personal information. We currently use\n                FreshDesk (privacy policy here) for AdBlock's\n                knowledge base and support system. AdBlock has used other services in the past\n                and may use more in the future. We do not control the data on these external services and can not remove or delete the data;\n                any data given to external services is not bound by this policy, and you should read the external service's privacy policy before providing any information.\n            \n\n            Data security\n            \n                All personal and usage information that AdBlock collects is stored in our databases and AdBlock takes reasonable steps to keep it secure.\n                That said, no database or server is 100% secure and we cannot guarantee the absolute security of your data in our system or while being\n                transmitted over the Internet. Our best effort is given, but you use AdBlock's website and browser extension at your own risk.\n            \n\n            What is the legal basis?\n            We collect and process your personal information in compliance with the GDPR and the applicable EU laws.\n            \n            Collection and processing is based on your consent: Art. 6 (1) a GDPR, Art. 4 (11) GDPR\n            \n                We will always ask for your consent to collect and process your personal information for the aforementioned specific purposes, unless the\n                collection and processing of your personal information is permitted by statutory laws. Where you have provided us with your consent to the\n                collection and processing of your personal information for the aforementioned specific purposes, you have the right to withdraw your consent\n                at any time.\n            \n            Collection and processing is necessary for taking steps prior to enter into a contract: Art. 6 (1) b GDPR\n            \n                The collection and processing of your personal information may be necessary for the performance of a contract to which you may be a party.\n                Prior to entering into such a contract, the collection and processing of your personal information may also be necessary in order to take steps\n                at your request. This applies for installation and the use of our extension as well as any payment processing in connection with donations.\n            \n            Collection and processing is necessary for compliance with a legal obligation to which the Controller is subject: Art. 6 (1) c GDPR\n            \n                Collection and processing of your personal information may be necessary for compliance with a legal obligation to which we are subject under\n                EU laws or the laws of a EU Member State.\n            \n            Collection and processing is necessary for the purposes of our legitimate interests: Art. 6 (1) f GDPR\n            \n                The collection and processing of your personal information may be necessary for the purposes of our legitimate interests. We collect and process\n                server logs for technical reasons, such as, but not limited to, preventing denial of service attacks. Denial of service is typically accomplished\n                by flooding the targeted machine or resource with superfluous requests in an attempt to overload systems and prevent some or all legitimate requests\n                from being fulfilled. Preventing such overloads of our systems and any security issues by denial of service attacks is in your and our vital interest\n                and therefore we use the website logs. We use information collected and processed via subscription downloads, extension update checks, emergency\n                notifications and feedback data sent by you, for technical reasons, such as, but not limited to, ensuring the security of the extension version used\n                by you. Ensuring the security of our extension is in your and our vital interest and therefore we use such data. Furthermore, we collect and process\n                such data to ensure that our website and extension are constantly improved and adjusted to the changing requirements for an efficient usability\n                and the technical environment. Ensuring the usability of our websites and of our extension is in your and our vital interest and therefore we use such data.\n            \n            Jointly determining purposes and means of data processing: Art. 26 (1) GDPR\n            \n                To build and improve upon products and features more efficiently, we share personal data, in compliance with GDPR, within the context of a joint controllership with partners. This does not affect how we process personal data as outlined in this privacy policy or how you can exercise your data subject’s rights towards us. You can always contact us with questions or feedback about our privacy policy here and can receive the essence of the arrangement between us and our partners via e-mail to privacy@adblock.org.\n            \n\n            What rights do you have?\n            \n                In compliance with the GDPR and the applicable EU laws and to the extent legally permitted, you have the following rights to protect your personal\n                information collected and processed by us:\n            \n            Information, access, rectification and restriction rights\n            \n                Naturally you have the right to receive, upon request, information about the personal information stored by us about you and information about how we\n                collect, process and store your personal information. Where that is the case, you have the right to gain access to such personal information stored by us.\n                You have the right to request from us the rectification of your inaccurate personal information. Taking into account the purposes of collecting and\n                processing your data, you have the right to have incomplete personal information completed. You have the right to request restriction of processing.\n            \n            Right to data portability\n            \n                You also have the right (1) to receive all personal information concerning you and which you have provided to us, in a structured, commonly used and\n                machine-readable format and (2) to transmit that data to another controller.\n            \n            Right to erasure of your data\n            \n                You have the right to demand from us the erasure of your personal information, where – inter alia – one of the following grounds applies:\n            \n            \n                    If we no longer need your personal information for the aforementioned purposes.\n                    If you withdraw your consent on which the collection and processing is based and where there are no other legal grounds for the collection and processing.\n                    If you object to the collection and processing and there are no overriding legitimate grounds for the collection and processing.\n                \n            \n            \n                Please note, if data needs to be retained for legal purposes pursuant to Art. 17 (3) GDPR, we will restrict the use of the respective data.\n            \n\n            Personal information in connection with payments\n            \n                If you have attempted a payment on the AdBlock website then you can request to have your email and name removed from our system. To\n                do this, please open a private ticket on our support site that contains\n                your Order ID or email for the purchase. Please note that AdBlock can only remove information from our own systems and cannot\n                make changes to data that you give to a payment processor.\n            \n\n            Right to lodge a complaint with a supervisory authority\n            \n                You have the right to lodge a complaint with a supervisory authority, in particular in the Member State of your habitual residence, place of work\n                or place of the alleged infringement if you consider that the collection and processing of personal information relating to you infringes the GDPR.\n            \n            Right to object to the processing of your data\n            \n                You have the right to object at any time to the collection and processing of your personal information on grounds relating to your particular\n                situation, when collection and processing is based on our legitimate interest (Art. 6 (1) f GDPR).\n            \n            Right to withdraw your consent at any time\n            \n                You have the right to withdraw your consent at any time, when you have provided us with your consent to the collection and processing of your\n                personal information for one or more specific purposes.\n            \n            How to exercise your rights\n            \n                To exercise your rights, please contact us here.\n            \n\n            Changes and updates to this policy\n            \n                AdBlock reserves the right to change this policy for any reason, and may make small, inconsequential changes to this\n                policy with or without notice. Each time this policy is changed we will revise the \"Effective Date\" at the top of this page.\n                When substantial changes are made to the disclosure of your personal information AdBlock will attempt to notify you through\n                the email that was provided during the payment process. Your continued use of the AdBlock website or browser extension constitutes your\n                agreement to this Privacy Policy and any revisions or updates.\n            \n\n            Contact\n            \n                You can always contact us with questions or feedback about our privacy policy here.\n            \n            ", "length": 26515, "excerpt": "AdBlock is a user-supported browser extension that lets you surf the web ad-free.", "siteName": null, "applied": false}